000100050729/*-------------------------------------------------------------------*/
000200050729/*                                                                   */
000300050729/*  Program . . : CBX9422                                            */
000400050729/*  Description : Display device IP address - CPP                    */
000500050729/*  Author  . . : Carsten Flensburg                                  */
000600050729/*                                                                   */
000700050729/*                                                                   */
000800050729/*  Compile options:                                                 */
000900050729/*                                                                   */
001000050729/*    CrtClPgm   Pgm( CBX9422 )                                      */
001100050729/*               SrcFile( QCLSRC )                                   */
001200050729/*               SrcMbr( *PGM )                                      */
001300050729/*                                                                   */
001400050729/*                                                                   */
001500050729/*-------------------------------------------------------------------*/
001600050729     Pgm        &Device
001700050729
001800050729     Dcl        &Device      *Char       10
001900050729     Dcl        &DevIp       *Char       15
002000030320
002100050729     MonMsg     CPF0000       *N         GoTo Error
002200040310
002300050729
002400050730     If       ( &Device = '*CURRENT' )   Do
002500050730     RtvJobA    Job( &Device )
002600050730     EndDo
002700050730
002800050730     Else Do
002900050730     ChkObj     &Device       *DEVD
003000050730     EndDo
003100050729
003200050729     RtvDevIp   Dev( &Device )  IpAddr( &DevIp )
003300050729
003400050729     SndPgmMsg  Msg( 'Device'         *Bcat  &Device *Bcat       +
003500050729                     'has IP address' *Bcat  &DevIp  *Tcat '.' ) +
003600050729                ToPgmQ( *PRV )                                   +
003700050729                MsgType( *COMP )
003800990504
003900050729Return:
004000050729     Return
004100050729
004200050729Error:
004300050729     Call       QMHMOVPM    ( '    '                  +
004400050729                              '*DIAG'                 +
004500050729                              x'00000001'             +
004600050729                              '*PGMBDY'               +
004700050729                              x'00000001'             +
004800050729                              x'0000000800000000'     +
004900050729                            )
005000050729
005100050729     Call       QMHRSNEM    ( '    '                  +
005200050729                              x'0000000800000000'     +
005300050729                            )
005400050729EndPgm:
005500050729     EndPgm
