000100050320/*-------------------------------------------------------------------*/
000200050320/*                                                                   */
000300050513/*  Program . . : CBX9352                                            */
000400050322/*  Description : Get serviced job ID                                */
000500050320/*  Author  . . : Carsten Flensburg                                  */
000600050320/*                                                                   */
000700050320/*                                                                   */
000800050320/*  Compile options:                                                 */
000900050320/*                                                                   */
001000050513/*    CrtClPgm   Pgm( CBX9352 )                                      */
001100050320/*               SrcFile( QCLSRC )                                   */
001200050320/*               SrcMbr( *PGM )                                      */
001300050320/*                                                                   */
001400050320/*                                                                   */
001500050320/*-------------------------------------------------------------------*/
001600050322     Pgm      ( &JobId )
001700021113
001800021114     Dcl        &JobId        *Char       26
001900050320
002000050322     DclF       QATRCJOB      AlwVarLen( *YES )
002100050322
002200050322
002300050314     MonMsg     CPF0000       *N        GoTo Error
002400050321
002500021114
002600050324     TrcJob     Set( *ON )                                 +
002700050324                TrcType( *FLOW )                           +
002800050324                MaxStg( 1024 )                             +
002900050324                SltPrc( *NONE )
003000050322
003100050322     TrcJob     Set( *OFF )                 +
003200050322                OutPut( *OUTFILE )          +
003300050322                OutFile( QTEMP/QATRCJOB )
003400050322
003500050322     RcvMsg     MsgType( *LAST )        Rmv( *YES )
003600050322     RcvMsg     MsgType( *LAST )        Rmv( *YES )
003700021113
003800050322     OvrDbf     QATRCJOB                    +
003900050322                ToFile( QTEMP/QATRCJOB )    +
004000050322                OvrScope( *CALLLVL )
004100050322
004200050322     RcvF
004300050322     MonMsg     CPF0864       *N        GoTo EoF
004400050322
004500050322     If      (( &SCFUNC  =  5 )    *And     +
004600050322              ( &SCSTYP  =  1 ))        Do
004700050322
004800050322     ChgVar     &JobId      ( &SCFLD1 *Cat &SCFLD2 *CAT &SCFLD3 )
004900050322
005000050322     GoTo       Return
005100050322     EndDo
005200050322
005300050322EoF:
005400050322     ChgVar     &JobId        '*NONE'
005500050322
005600050320Return:
005700050322     DltOvr     QATRCJOB      Lvl( * )
005800050322
005900050320     Return
006000021114
006100021114Error:
006200050301     Call       QMHMOVPM    ( '    '                  +
006300050301                              '*DIAG'                 +
006400050301                              x'00000001'             +
006500050301                              '*PGMBDY'               +
006600050301                              x'00000001'             +
006700050301                              x'0000000800000000'     +
006800050301                            )
006900050301
007000050301     Call       QMHRSNEM    ( '    '                  +
007100050301                              x'0000000800000000'     +
007200050301                            )
007300021113EndPgm:
007400021113     EndPgm
