000100041201     Pgm
000200021010
000300050210     Dcl        &SpcAut      *Char   150
000400951127
000500050211     RtvUsrSpcA UsrPrf( <user profile> )    +
000600050211                Option( *USRPRF )           +
000700050210                SpcAut( &SpcAut )
000800050211
000900041203
001000041211     /*-- Do whatever ... --*/
001100041203
001200041203EndPgm:
001300021010     EndPgm
