     Pgm

     Dcl        &SpcAut      *Char   150

     RtvUsrSpcA UsrPrf( <user profile> )    +
                Option( *USRPRF )           +
                SpcAut( &SpcAut )


     /*-- Do whatever ... --*/

EndPgm:
     EndPgm
