000100060216/*-------------------------------------------------------------------*/
000200060216/*                                                                   */
000300060216/*  Program . . : CBX955                                             */
000400060216/*  Description : Scan string - CPP                                  */
000500060216/*  Author  . . : Carsten Flensburg                                  */
000600060216/*                                                                   */
000700060216/*                                                                   */
000800060216/*  Compile options:                                                 */
000900060216/*                                                                   */
001000060216/*    CrtClPgm   Pgm( CBX955 )                                       */
001100060216/*               SrcFile( QCLSRC )                                   */
001200060216/*               SrcMbr( *PGM )                                      */
001300060216/*                                                                   */
001400060216/*                                                                   */
001500060216/*-------------------------------------------------------------------*/
001600060216     Pgm      ( &ChrStr           +
001700060216                &ChrPat           +
001800060216                &StrPos           +
001900060216                &TrnChr           +
002000060216                &Trim             +
002100060216                &WldChr           +
002200060216                &PatPos           +
002300060216              )
002400060216
002500060216     Dcl        &ChrStr     *Char  1001
002600060216     Dcl        &ChrPat     *Char  1001
002700060216     Dcl        &StrPos     *Dec      3
002800060216     Dcl        &TrnChr     *Char     1
002900060216     Dcl        &Trim       *Char     1
003000060216     Dcl        &WldChr     *Char     1
003100060216     Dcl        &PatPos     *Dec      3
003200940414
003300060216     Dcl        &StrLen     *Dec      3
003400060216     Dcl        &PatLen     *Dec      3
003500060216     Dcl        &ScnStr     *Char   999
003600060216     Dcl        &PatStr     *Char   999
003700940414
003800060216/*-- Global error monitoring:  --------------------------------------*/
003900060216     MonMsg     CPF0000     *N       GoTo Error
004000940408
004100940711
004200060216     ChgVar     &StrLen        %Bin( &ChrStr  1    2 )
004300060216     ChgVar     &ScnStr        %Sst( &ChrStr  3  999 )
004400060216     ChgVar     &PatLen        %Bin( &ChrPat  1    2 )
004500060216     ChgVar     &PatStr        %Sst( &ChrPat  3  999 )
004600940711
004700060216     Call       QCLSCAN        Parm( &ScnStr                    +
004800060216                                     &StrLen                    +
004900060216                                     &StrPos                    +
005000060216                                     &PatStr                    +
005100060216                                     &PatLen                    +
005200060216                                     &TrnChr                    +
005300060216                                     &Trim                      +
005400060216                                     &WldChr                    +
005500060216                                     &PatPos                    +
005600060216                                   )
005700940408
005800060216 Return:
005900060216     Return
006000060216
006100060216/*-- Resend system error messages:  ---------------------------------*/
006200060216 Error:
006300060216     Call       QMHMOVPM    ( '    '                            +
006400060216                              '*DIAG'                           +
006500060216                              x'00000001'                       +
006600060216                              '*PGMBDY'                         +
006700060216                              x'00000001'                       +
006800060216                              x'0000000800000000'               +
006900060216                            )
007000060216
007100060216     Call       QMHRSNEM    ( '    '                            +
007200060216                              x'0000000800000000'               +
007300060216                            )
007400060216
007500060216 EndPgm:
007600060216     EndPgm
